app/Views/auth/login_client.php

                    <label>Préfixe</label>
                    <select name="prefixe" required>
                        <option value="">Sélectionnez</option>
                        <?php foreach ((new \App\Models\PrefixModel())->findAll() as $prefix): ?>
---
SELECT *
FROM `prefixes`