app/Controllers/ClientMobileMoneyController.php

    public function withdraw()
    {
        if (!session()->get('connecte')) {
            return redirect()->to(base_url('mobile-money/login'));
        }

        $telephone = $this->request->getPost('telephone');
        $montant = (float) $this->request->getPost('montant');
        $inclureFrais = (bool) $this->request->getPost('inclure_frais');

        if (empty($telephone) || $montant <= 0) {
            return redirect()->back()->with('error', 'Téléphone et montant sont requis.');
        }

        $clientModel = new ClientModel();
        $transactionModel = new TransactionModel();
        $typeOperationModel = new TypeOperationModel();
        $baremeModel = new BaremeFraisModel();
        $prefixModel = new PrefixModel();

        $client = $clientModel->firstOrCreate($telephone);
        $typeOperationId = $typeOperationModel->getIdByName('Retrait');

        $prefixInfo = $prefixModel->where('prefixe', substr($telephone, 0, 3))->first();
---
SELECT *
FROM `prefixes`
WHERE `prefixe` = '033'
 LIMIT 1