app/Controllers/MobileMoneyController.php

    public function clientDashboard()
    {
        if (!session()->get('connecte')) {
            return redirect()->to(base_url('mobile-money/login'));
        }

        $this->initializeDatabaseFromSql();

        $clientModel = new ClientModel();
        $transactionModel = new TransactionModel();
        $typeOperationModel = new TypeOperationModel();
        $client = $clientModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1