app/Controllers/MobileMoneyController.php

    public function clientDashboard()
    {
        if (!session()->get('connecte')) {
            return redirect()->to(base_url('mobile-money/login'));
        }

        $clientModel = new ClientModel();
        $transactionModel = new TransactionModel();
        $typeOperationModel = new TypeOperationModel();
        $client = $clientModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2

    public function operatorDashboard()
    {
        $redirect = $this->ensureOperator();
        if ($redirect !== null) {
            return $redirect;
        }

        $clientModel = new ClientModel();
        $transactionModel = new TransactionModel();
        $prefixModel = new PrefixModel();
        $typeOperationModel = new TypeOperationModel();
        $feeModel = new BaremeFraisModel();

        $clients = $clientModel->findAll();
        $transactions = $transactionModel->findAll();
        $prefixes = $prefixModel->orderBy('prefixe', 'ASC')->findAll();
---
SELECT *
FROM `clients`
SELECT *
FROM `transactions`
SELECT *
FROM `prefixes`
ORDER BY `prefixe` ASC