app/Controllers/OperatorMobileMoneyController.php

    public function operatorTransactions()
    {
        $redirect = $this->ensureOperator();
        if ($redirect !== null) {
            return $redirect;
        }

        $this->initializeDatabaseFromSql();

        $transactionModel = new TransactionModel();
        $typeOperationModel = new TypeOperationModel();
        $transactions = $transactionModel->findAll();
---
SELECT *
FROM `transactions`

    public function operatorHistoryInternal()
    {
        $redirect = $this->ensureOperator();
        if ($redirect !== null) {
            return $redirect;
        }

        $this->initializeDatabaseFromSql();

        $transactionModel = new TransactionModel();
        $typeOperationModel = new TypeOperationModel();
        $transactions = $transactionModel->where('est_vers_autre_operateur', 0)
            ->orderBy('date_transaction', 'DESC')
            ->findAll();
---
SELECT *
FROM `transactions`
WHERE `est_vers_autre_operateur` = 0
ORDER BY `date_transaction` DESC

    public function operatorHistoryExternal()
    {
        $redirect = $this->ensureOperator();
        if ($redirect !== null) {
            return $redirect;
        }

        $this->initializeDatabaseFromSql();

        $transactionModel = new TransactionModel();
        $typeOperationModel = new TypeOperationModel();
        $transactions = $transactionModel->where('est_vers_autre_operateur', 1)
            ->orderBy('date_transaction', 'DESC')
            ->findAll();
---
SELECT *
FROM `transactions`
WHERE `est_vers_autre_operateur` = 1
ORDER BY `date_transaction` DESC