app/Models/BaremeModel.php

    public function getBaremesWithType()
    {
        return $this->select('baremes_frais.*, types_operations.nom as type_nom')
                    ->join('types_operations', 'types_operations.id = baremes_frais.type_operation_id')
                    ->findAll();
---
SELECT `baremes_frais`.*, `types_operations`.`nom` as `type_nom`
FROM `baremes_frais`
JOIN `types_operations` ON `types_operations`.`id` = `baremes_frais`.`type_operation_id`