app/Models/ClientModel.php

    public function firstOrCreate(string $telephone): array
    {
        $client = $this->where('telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0331234567'
 LIMIT 1

    public function updateBalance(int $id, float $balance): bool
    {
        return (bool) $this->update($id, ['solde' => $balance]);
---
UPDATE `clients` SET `solde` = 54827199
WHERE `clients`.`id` IN (1)

    public function getBalance(int $id): float
    {
        $client = $this->find($id);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1