app/Models/PrefixModel.php

SELECT *
FROM `prefixes`
WHERE `prefixe` = '033'
 LIMIT 1
---
    public function isAllowed(string $telephone): bool
    {
        $prefix = substr($telephone, 0, 3);
        $row = $this->where('prefixe', $prefix)->first();