app/Models/TransactionModel.php

INSERT INTO `transactions` (`type_operation_id`, `expediteur_id`, `destinataire_id`, `montant`, `frais`, `est_vers_autre_operateur`) VALUES (2, 1, NULL, 49001, 1000, 0)
---
    public function record(int $typeOperationId, ?int $expediteurId, ?int $destinataireId, float $montant, float $frais): bool
    {
        return (bool) $this->insert([
            'type_operation_id' => $typeOperationId,
            'expediteur_id' => $expediteurId,
            'destinataire_id' => $destinataireId,
            'montant' => $montant,
            'frais' => $frais,
        ]);

SELECT *
FROM `transactions`
WHERE `expediteur_id` = 2
OR `destinataire_id` = 2
ORDER BY `date_transaction` DESC
---
    public function getByClient(int $clientId): array
    {
        return $this->where('expediteur_id', $clientId)
            ->orWhere('destinataire_id', $clientId)
            ->orderBy('date_transaction', 'DESC')
            ->findAll();