app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = '0331234567'
 LIMIT 1
---
    public function authenticate(string $username, string $password): ?array
    {
        $user = $this->where('username', $username)->first();

SELECT *
FROM `users`
WHERE `username` = '0331234567'
 LIMIT 1
---
    public function createClientUser(string $telephone, string $password = ''): array
    {
        $existing = $this->where('username', $telephone)->first();